{
  "title": "Starting a New Software Project",
  "html": "<p>The phrase “writer’s block” is used to describe the feeling of getting stuck when starting a new project. Although\n  the true meaning of writer’s block is closer to a years-long “creative drought” almost everyone has this shared\n  experience and developers are no different. Making progress on a new project can be a slow and tedious process,\n  especially for inexperienced programmers. I believe that the reasons for this are not due to the skill of the\n  programmer, but a combination of inexperience and lack of confidence.\n</p>\n\n<h2>\n  Development Process\n</h2>\n<p>\n  Even for personal projects, it helps to follow some kind of process to guide along progress. There have been countless\n  books written, blog posts posted, and lectures lectured about the topic, but my process follows these general\n  guidelines.\n</p>\n\n<h3>Determine the overall goal of the project.</h3>\n\n<p>It can be as general as needed although it helps to be more specific, and should not be technical at all. This step\n  can also act as a filter for projects that might be better off not done at all: if a high-quality library already\n  exists for the thing you’d like to create and your goal is something other than to gain enjoyment from creating a\n  similar library, it might be best to just use that library.</p>\n\n<h3>Research other projects doing the same thing.</h3>\n<p>Finding other projects which have already solved the same problem will be valuable as a starting point and may help\n  you in your search for frameworks or libraries to use in your own project. In an enterprise setting, it would be wise\n  to use a pre-existing project instead of creating a new one. However, personal projects are fundamentally different\n  than commercial ones. The point of a personal project is often just to gain experience or enjoyment from creating\n  something.</p>\n\n<p>The thought processes started by the first two steps should help start the brainstorming and researching process. At\n  this point, general software development techniques kick in. It can be helpful to create a few small proof of concepts\n  at this point to get a feel for what works and what doesn’t. After this, I follow these steps:</p>\n\n<h3>Sketch a high level overview of the project.</h3>\n<p>This should be very abstract and considers the project as a whole. I feel that it helps to sketch out the components\n  in the project and the flow of data. One major roadblock I run into when starting a new project is deciding what kind\n  of overall architecture I want my project to have, so figuring out how project components will fit together helps to\n  determine how the code will be structured. There are often many valid solutions to a problem, with no clear best\n  choice. Some patterns are quicker to develop with while others are easier to scale and add onto. The first few commits\n  in a project are crucial for the architecture since it is hard to go back and change an entire project to follow a\n  different pattern.</p>\n\n<h3>Create project scaffolding.</h3>\n<p>Lots of frameworks provide this with their cli, such as express-generator. If your project follows a very common\n  design pattern or you are using a popular framework, then this can really speed up your development time (and\n  therefore overcome your writer’s block). If not, it’s not too important at the beginning of the project. If you decide\n  that your project will be more manageable using a different layout, it isn’t too hard to refactor while the project is\n  still small.</p>\n\n<h3>Outline the classes, functions, etc.</h3>\n<p>One aspect that I like about writing C code is that you can create an overview of your project just by writing header\n  files first and implementing them later. You can simulate this in any language though as long as you put in dummy\n  return statements in your functions. I find that this approach is helpful since it forces me to take a top-down\n  approach to development. Taking a top-down approach is also helpful for overcoming writer’s block because I don’t get\n  stuck on implementation details too early.</p>\n\n<p>Once I’ve done all of the above, I usually don’t have any trouble moving forward with a project.</p>\n"
}
